# EnableDepthCueing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayDepthCueing..::..EnableDepthCueing Property
ViewDisplayDepthCueing Class See Also
---
True to enable depth cueing. False to disable it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool EnableDepthCueing { get; set; }
```

Visual Basic
---
```text
Public Property EnableDepthCueing As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool EnableDepthCueing {
	bool get ();
	void set (bool value);
}
```

# See Also
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace